addLayer("lcb", { //这是代码中的节点代码 例如player.p可以调用该层级的数据 尽量使用顺手的字母什么的 不建议数字开头
    symbol: `M`, // 这是节点上显示的字母
    position: 1, // 节点顺序
    startData() {
        return {
            unlocked: true, //是否开始就解锁
            points: new ExpantaNum(0),
        }
    },
    requires() { return new ExpantaNum("1e40000") },
    color: "#793784",
    resource: "00里程碑", // 重置获得的资源名称
    type: "static", // normal: cost to gain currency depends on amount gained. static: cost depends on how much you already have
    passiveGeneration() {

        return 0
    },
    effectDescription() {
        return `
        虚晃一枪，这个层级不重置任何东西<br>
        `},
    exponent: 1,
    baseAmount() { return player.points },//基础资源数量
    baseResource: "点数",//基础资源名称
    gainMult() { // 资源获取数量倍率
        mult = new ExpantaNum(1)

        return mult
    },
    gainExp() { // 资源获取指数加成(与exponent相乘)
        var exp = new ExpantaNum(0.5)

        return exp
    },
    layerShown() { return hasMilestone("l", 35) || hasMilestone("cq", 1) },
    row: 99, // Row the layer is in on the tree (0 is the first row)  QwQ:1也可以当第一排
    getNextAt() {
        let gain = player.lcb.points
        return n("1e40000").pow(n(1.05).pow(gain))
    },
    milestones: {
        1: {
            requirementDescription: "第100个里程碑",//!!群友说的问题你自己去修 谢谢了谢谢了 这玩意我真懒得优化
            effectDescription: "当点数到e1, e4, e9, e16, e25, e36, e49, e64, e81, e100, e121, e144, e169, e196, e225, e256, e289, e324, e361, e400, e441, e484, e529, e576, e625, e676, e729, e784, e841, e900, e961, e1024, e1089, e1156, e1225, e1296, e1369, e1444, e1521, e1600, e1681, e1764, e1849, e1936, e2025, e2116, e2209, e2304, e2401, e2500, e2601, e2704, e2809, e2916, e3025, e3136, e3249, e3364, e3481, e3600, e3721, e3844, e3969, e4096, e4225, e4356, e4489, e4624, e4761, e4900, e5041, e5184, e5329, e5476, e5625, e5776, e5929, e6084, e6241, e6400, e6561, e6724, e6889, e7056, e7225, e7396, e7569, e7744, e7921, e8100, e8281, e8464, e8649, e8836, e9025, e9216, e9409, e9604, e9801, e10000时,点数获取x1e10",
            done() { return player.lcb.points.gte(1) }
        },

        2: {
            requirementDescription: "第200个里程碑",
            effectDescription: "当扩张完成次数到11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110时,基础生命获取指数+1",
            done() { return player.lcb.points.gte(2) }
        },
        3: {
            requirementDescription: "第300个里程碑",
            effectDescription: "当生命到e1, e2, e3, e4, e5, e6, e7, e8, e9, e10, e11, e12, e13, e14, e15, e16, e17, e18, e19, e20, e21, e22, e23, e24, e25, e26, e27, e28, e29, e30, e31, e32, e33, e34, e35, e36, e37, e38, e39, e40, e41, e42, e43, e44, e45, e46, e47, e48, e49, e50, e51, e52, e53, e54, e55, e56, e57, e58, e59, e60, e61, e62, e63, e64, e65, e66, e67, e68, e69, e70, e71, e72, e73, e74, e75, e76, e77, e78, e79, e80, e81, e82, e83, e84, e85, e86, e87, e88, e89, e90, e91, e92, e93, e94, e95, e96, e97, e98, e99, e100时,生命获取x1.1",
            done() { return player.lcb.points.gte(3) }
        },
        4: {
            requirementDescription: "第400个里程碑",
            effectDescription: "当声望点到e20100, e20200, e20300, e20400, e20500, e20600, e20700, e20800, e20900, e21000, e21100, e21200, e21300, e21400, e21500, e21600, e21700, e21800, e21900, e22000, e22100, e22200, e22300, e22400, e22500, e22600, e22700, e22800, e22900, e23000, e23100, e23200, e23300, e23400, e23500, e23600, e23700, e23800, e23900, e24000, e24100, e24200, e24300, e24400, e24500, e24600, e24700, e24800, e24900, e25000, e25100, e25200, e25300, e25400, e25500, e25600, e25700, e25800, e25900, e26000, e26100, e26200, e26300, e26400, e26500, e26600, e26700, e26800, e26900, e27000, e27100, e27200, e27300, e27400, e27500, e27600, e27700, e27800, e27900, e28000, e28100, e28200, e28300, e28400, e28500, e28600, e28700, e28800, e28900, e29000, e29100, e29200, e29300, e29400, e29500, e29600, e29700, e29800, e29900, e30000,时,声望点获取^1.01，1.02，1.03，1.04，1.05，1.06，1.07，1.08，1.09，1.10，1.11，1.12，1.13，1.14，1.15，1.16，1.17，1.18，1.19，1.20，1.21，1.22，1.23，1.24，1.25，1.26，1.27，1.28，1.29，1.30，1.31，1.32，1.33，1.34，1.35，1.36，1.37，1.38，1.39，1.40，1.41，1.42，1.43，1.44，1.45，1.46，1.47，1.48，1.49，1.50，1.51，1.52，1.53，1.54，1.55，1.56，1.57，1.58，1.59，1.60，1.61，1.62，1.63，1.64，1.65，1.66，1.67，1.68，1.69，1.70，1.71，1.72，1.73，1.74，1.75，1.76，1.77，1.78，1.79，1.80，1.81，1.82，1.83，1.84，1.85，1.86，1.87，1.88，1.89，1.90，1.91，1.92，1.93，1.94，1.95，1.96，1.97，1.98，1.99，2.00",
            done() { return player.lcb.points.gte(4) }
        },
        5: {
            requirementDescription: "第500个里程碑",
            effectDescription: "当里程碑到500, 600, 700, 800, 900, 1000, 1100, 1200, 1300, 1400,1500, 1600, 1700, 1800, 1900, 2000, 2100, 2200, 2300, 2400,2500, 2600, 2700, 2800, 2900, 3000, 3100, 3200, 3300, 3400,3500, 3600, 3700, 3800, 3900, 4000, 4100, 4200, 4300, 4400,4500, 4600, 4700, 4800, 4900, 5000, 5100, 5200, 5300, 5400,5500, 5600, 5700, 5800, 5900, 6000, 6100, 6200, 6300, 6400,6500, 6600, 6700, 6800, 6900, 7000, 7100, 7200, 7300, 7400,7500, 7600, 7700, 7800, 7900, 8000, 8100, 8200, 8300, 8400,8500, 8600, 8700, 8800, 8900, 9000, 9100, 9200, 9300, 9400,9500, 9600, 9700, 9800, 9900, 10000, 10100, 10200, 10300, 10400时，战力获取x2",
            done() { return player.lcb.points.gte(5) }
        },
    },
    resetsNothing: true,
    autoPrestige() { return hasAchievement("rw", 34) },


})
